Revit 2026 API

# FilteredElementCollectorWherePasses Method

---

Applies an element filter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector WherePasses(
	ElementFilter filter
)
```
```vb
Public Function WherePasses (
	filter As ElementFilter
) As FilteredElementCollector
```
```cpp
public:
FilteredElementCollector^ WherePasses(
	ElementFilter^ filter
)
```
```fsharp
member WherePasses :
        filter : ElementFilter -> FilteredElementCollector
```

#### Parameters

filter ElementFilter
     The element filter.

#### Return Value

FilteredElementCollector A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The filter will be added as an additional condition that all filtered elements must pass. If you have an active iterator to this collector it will be stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace